app/Controllers/ProdukController.php

SELECT *
FROM `product`
---
    public function index()
    {
        $product = $this->product->findAll();